Revit 2024 API
MEPModel Properties
The MEPModel type exposes the following members.
Properties
Name | Description
ConnectorManager
 Retrieves the Connector Manager from this MEPModel.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
MEPModel Class
Autodesk.Revit.DB Namespace